app/services/get_playlist_service.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def call
        playlists_spotify = @user.playlists

        playlist_spotify = playlists_spotify.map do |playlist|
            playlist if playlist.id == Playlist.find(@id_playlist).id_spotify