app/controllers/home_controller.rb

  def index
    if request.env['omniauth.auth']
      @spotify_user = RSpotify::User.new(request.env['omniauth.auth'])
      current_user.user_hash = @spotify_user.to_hash
      current_user.save
---
UPDATE "users" SET "user_hash" = $1, "updated_at" = $2 WHERE "users"."id" = $3