app/controllers/musics_controller.rb

SELECT "playlists".* FROM "playlists" WHERE (1) LIMIT $1  [["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "musics".* FROM "musics" WHERE "musics"."playlist_id" = $1 ORDER BY "musics"."id" DESC LIMIT $2  [["playlist_id", 9], ["LIMIT", 1]]
SELECT 1 AS one FROM "musics" WHERE "musics"."playlist_id" = $1 LIMIT $2  [["playlist_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "musics".* FROM "musics" WHERE "musics"."playlist_id" = $1 ORDER BY "musics"."id" DESC LIMIT $2  [["playlist_id", 2], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "musics" ("name", "href", "id_spotify", "time", "playlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        spotify_user = RSpotify::User.new(current_user.user_hash)
        playlists_spotify = spotify_user.playlists

        playlist_spotify = playlists_spotify.map do |playlist|
            playlist if playlist.id == Playlist.find(music_params[:playlist_id]).id_spotify
        end

        playlist_spotify = playlist_spotify.reject(&:blank?)
        playlist_spotify = playlist_spotify[0]

        track = RSpotify::Track.find(music_params[:id_spotify])

        if Playlist.find_by(id: music_params[:playlist_id]).musics.exists?
            AddMusicJob.set(wait: ((Playlist.find_by(id: music_params[:playlist_id]).musics.last.time/1000) - 5 ).seconds).perform_later(current_user.user_hash , music_params[:id_spotify], music_params[:playlist_id])
        else
            AddMusicJob.perform_now(current_user.user_hash , music_params[:id_spotify], music_params[:playlist_id])
        end

        @music = Music.new(
            name: track.name,
            href: track.href,
            id_spotify: track.id,
            time: track.duration_ms,
            playlist_id: music_params[:playlist_id]
        )

        if @music.save