app/controllers/musics_controller.rb

    def index
        @musics = Music.all
---
SELECT "musics".* FROM "musics"

    def create
        spotify_user = RSpotify::User.new(current_user.user_hash)

        track = RSpotify::Track.find(music_params[:id_spotify])

        if Playlist.find_by(id: music_params[:playlist_id]).musics.where(id_spotify: track.id).exists?
---
SELECT 1 AS one FROM "musics" WHERE "musics"."playlist_id" = $1 AND "musics"."id_spotify" = $2 LIMIT $3  [["playlist_id", 2], ["id_spotify", "5wyifj9jya5OUkuTKLFIhn"], ["LIMIT", 1]]

    def destroy
        @music = Music.find_by(id: params[:id])
        track_of_spotify =  RSpotify::Track.find(@music.id_spotify)
        playlist_spotify = GetPlaylistService.new({hash: current_user.user_hash , id_playlist: @music.playlist.id}).call

        if !(@music.sounded)
            playlist_spotify.remove_tracks!([track_of_spotify])
        end

        @music.destroy
---
SELECT "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "musics" WHERE "musics"."id" = $1  [["id", 8]]