app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
    def index
        @playlist = Playlist.all

INSERT INTO "playlists" ("name", "image_url", "public", "user_id", "owner", "href", "uri", "path", "id_spotify", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        spotify_user = RSpotify::User.new(current_user.user_hash)

        begin
            playlist_spotify = spotify_user.create_playlist!(playlist_params[:name], public: false, collaborative: true )
        rescue RestClient::BadRequest
            redirect_to '/auth/spotify'
        end

        @playlist = current_user.playlists.build(
            name: playlist_params[:name],
            image_url: playlist_spotify.images,
            public: playlist_spotify.public ,
            owner: playlist_spotify.owner.to_hash ,
            href: playlist_spotify.href,
            uri: playlist_spotify.uri ,
            path: playlist_spotify.path ,
            id_spotify: playlist_spotify.id
        )

        if @playlist.save

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @playlist = Playlist.find_by(id: params[:id])

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 3]]
---
    def destroy
        @playlist = Playlist.find_by(id: params[:id])
        playlist_spotify = GetPlaylistService.new({hash: current_user.user_hash , id_playlist: params[:id]}).call

        begin
            playlist_spotify.remove_tracks!(playlist_spotify.tracks)
        rescue RestClient::BadRequest
            redirect_to '/auth/spotify'
        end

        if @playlist.destroy