app/views/musics/_form.html.erb

        <%= form.label :playlist_id %>
        <%= form.collection_select :playlist_id, Playlist.all, :id, :name, include_blank: false %>
---
SELECT "playlists".* FROM "playlists"