app/jobs/add_music_job.rb

  def perform(hash , music_id, playlist_id)

    track = RSpotify::Track.find(music_id)

    spotify_user = RSpotify::User.new(hash)
    playlists_spotify = spotify_user.playlists

    playlist_spotify = playlists_spotify.map do |playlist|
        playlist if playlist.id == Playlist.find(playlist_id).id_spotify
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]