app/jobs/remove_music_job.rb

  def perform(user_id, playlist_id)
    # Recupera Infomrações do Banco de Dados
    user = User.find_by(id: user_id)
    playlist_app = Playlist.includes(:musics).find_by(id: playlist_id)

    # Recupera as informações do Usuário na API do spotify
    spotify_user = RSpotify::User.new(user.user_hash)

    # Compara as Musicas recentementes tocadas com as da Playlist
    latest_musics = spotify_user.recently_played
    ids_latest_musics = latest_musics.map(&:id)
    musics_of_playlist_app = playlist_app.musics.where(id_spotify: ids_latest_musics, sounded: false)
    tracks = RSpotify::Track.find(musics_of_playlist_app.map(&:id_spotify))

    #Recupera a playlist do Spotify
    playlist_spotify = GetPlaylistService.new({hash: user.user_hash , id_playlist: playlist_id}).call
    playlist_spotify.remove_tracks!(tracks)

    # Altera as musicas para "Tocada"
    musics_of_playlist_app.map do |music|
      music.sounded = true
      music.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "musics".* FROM "musics" WHERE "musics"."playlist_id" = $1  [["playlist_id", 2]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "musics".* FROM "musics" WHERE "musics"."playlist_id" = $1 AND "musics"."id_spotify" IN ($2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21)
SELECT "musics".* FROM "musics" WHERE "musics"."playlist_id" = $1 AND "musics"."id_spotify" IN ($2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) AND "musics"."sounded" = $22
UPDATE "musics" SET "sounded" = $1, "updated_at" = $2 WHERE "musics"."id" = $3  [["sounded", true], ["updated_at", "2021-05-26 22:45:52.390036"], ["id", 9]]